apply better security for hosting, smaller docker footage
apply better security for hosting, smaller docker footage
